"%1$@ •••• %2$@" = "%1$@ •••• %2$@";

"+ Add" = "+ Přidat";

"Add US bank account" = "Přidat bankovní účet v USA";

"Add a card" = "Přidat kartu";

"Add a payment method" = "Přidat způsob platby";

"Add card" = "Přidat kartu";

"Add new card" = "Přidat novou kartu";

"Add new payment method" = "Nová platební metoda";

"Add your payment information" = "Přidejte své platební údaje";

"Approve payment" = "Schválit platbu";

"Back" = "Zpět";

"Bank" = "Banka";

"Bank account" = "Bankovní účet";

"Buy now or pay later with <img/>" = "Kupte nyní nebo zaplaťte později pomocí <img/>";

"Buy now or pay later with Afterpay" = "Koupit nyní nebo zaplatit pomocí Afterpay";

"Buy now or pay later with Clearpay" = "Koupit nyní nebo zaplatit pomocí Clearpay";

"Buy now or pay later with Klarna" = "Koupit nyní nebo zaplatit pomocí Klarna";

"Buy using a UPI ID" = "Koupit pomocí UPI ID";

"By confirming your payment with PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Potvrzením platby prostřednictvím služby PayPal povolujete, aby společnost %@ účtovala z vašeho účtu PayPal budoucí platby v souladu s jejich podmínkami.";

"By continuing to Amazon Pay, you allow %@ to charge your Amazon Pay account for future payments in accordance with their terms." = "Pokračováním v Amazon Pay povolujete společnosti %@, aby v souladu se svými podmínkami účtovala na váš účet Revolut Pay budoucí platby.";

"By continuing to Klarna, you allow %@ to charge your Klarna account for future payments in accordance with their terms and Klarna's terms. You can change this at any time in your Klarna app or by reaching out to %@." = "Pokračováním ve službě Klarna povolujete společnosti %1$@, aby v souladu s jejími podmínkami a podmínkami účtovala na váš účet Klarna budoucí platby. Toto můžete kdykoli změnit v aplikaci Klarna nebo tak, že se obrátíte na %2$@.";

"By continuing to PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Pokračováním na PayPal povolujete společnosti %@, aby v souladu se svými podmínkami strhávala z vašeho účtu PayPal budoucí platby.";

"By continuing to Revolut Pay, you allow %@ to charge your Revolut Pay account for future payments in accordance with their terms." = "Pokračováním v Revolut Pay povolujete společnosti %@, aby v souladu se svými podmínkami účtovala na váš účet Revolut Pay budoucí platby.";

"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "Pokračovaním souhlasíte s autorizací plateb podle <terms>těchto podmínek</terms>.";

"By continuing, you authorize %@ to debit your Cash App account for this payment and future payments in accordance with %@'s terms, until this authorization is revoked. You can change this anytime in your Cash App Settings." = "Pokračováním povolujete, %1$@ aby odepisovala z vašeho účtu Cash App tuto platbu a budoucí platby v souladu s podmínkami společnosti %2$@, dokud toto oprávnění neodvoláte. Toto oprávnění můžete kdykoli změnit v nastavení aplikace Cash App.";

"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Připojením se ke službám Link vyjadřujete zároveň svůj souhlas s <terms>Podmínkami</terms> a <privacy>Zásadami ochrany osobních údajů</privacy>.";

"By providing your bank account details and confirming this payment, you agree to this Direct Debit Request and the <terms>Direct Debit Request service agreement</terms>, and authorise Stripe Payments Australia Pty Ltd ACN 160 180 343 Direct Debit User ID number 507156 (“Stripe”) to debit your account through the Bulk Electronic Clearing System (BECS) on behalf of %@ (the \"Merchant\") for any amounts separately communicated to you by the Merchant. You certify that you are either an account holder or an authorised signatory on the account listed above." = "Souhlasíte s touto žádostí o přímé inkaso a <terms>smlouvou o službách žádosti o přímé inkaso</terms>a udělujete společnosti Stripe Payments Australia Pty Ltd ACN 160 180 343 identifikační číslo uživatele přímého inkasa 507156 ( „Stripe“) připsat k tíží na váš účet prostřednictvím elektronického systému hromadného zúčtování (BECS) jménem společnosti %@ („Obchodník“) jakoukoli částku, kterou vám Obchodník sdělí. Potvrzujete, že jste vlastníkem účtu nebo osobou s podpisovými právy k výše uvedenému účtu.";

"By providing your card information, you allow %@ to charge your card for future payments in accordance with their terms." = "Poskytnutím údajů o vaší kartě povolujete společnosti %@, aby si v souladu se svými podmínkami strhla z vaší karty poplatky za budoucí platby.";

"By providing your email, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Poskytnutím svého e-mailu souhlasíte s vytvořením účtu Link a uložením vašich platebních informací v rámci služby Link, a to v souladu s <terms>Podmínkami</terms> a <privacy>zásadami ochrany osobních údajů</privacy>.";

"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Tím, že zadáte informace o platbě a potvrdíte tuto platbu, udělujete společnosti (A) %@ a Stripe, našemu poskytovateli platebních služeb, oprávnění zaslat do vaší banky pokyny k zatížení vašeho účtu a (B) vaší bance zatížit váš účet na základě těchto pokynů. V rámci svých práv máte nárok na refundaci od banky na základě smluvních podmínek vaší smlouvy s bankou. Refundaci je nutné nárokovat během 8 týdnů od data, kdy byl váš účet zatížen. Vaše práva jsou vysvětlena v prohlášení, které můžete získat od banky.";

"By providing your phone number, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Poskytnutím svého telefonního čísla souhlasíte s vytvořením účtu Link a uložením vašich platebních informací v rámci služby Link, a to v souladu s <terms>Podmínkami</terms> a <privacy>zásadami ochrany osobních údajů</privacy>.";

"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Uložením bankovního účtu pro společnost %@ souhlasíte s autorizací plateb podle <terms>těchto podmínek</terms>.";

"CPF/CPNJ" = "CPF/CPNJ";

"Cancel and pay another way" = "Zrušit a zaplatit jiným způsobem";

"Choose a payment method" = "Zvolte platební metodu";

"Close card scanner" = "Zavřít skener karty";

"Confirm" = "Potvrdit";

"Confirm the payment in your bank or payment app within %@ to complete the purchase." = "Pro dokončení nákupu potvrďte platbu ve své bance nebo platební aplikaci do %@.";

"Confirm the payment in your bank's app within %@ to complete the purchase." = "Dokončete nákup potvrzením platby v bankovní aplikaci do  %@.";

"Confirm your CVC" = "Potvrďte vaše CVC";

"Contact information" = "Kontaktní údaje";

"EPS Bank" = "Banka EPS";

"Enter address manually" = "Zadejte adresu ručně";

"FPX Bank" = "Banka FPX";

"I understand that Stripe will be collecting Direct Debits on behalf of %@ and confirm that I am the account holder and the only person required to authorise debits from this account." = "Rozumím tomu, že Stripe bude vybírat přímé debety jménem %@, a potvrzuji, že jsem držitelem účtu a jedinou osobou, která je nezbytná k autorizování debetů z tohoto účtu.";

"IBAN" = "IBAN";

"Manage payment method" = "Spravovat způsob platby";

"Manage payment methods" = "Spravovat způsoby platby";

"Manage your payment methods" = "Spravujte své platební metody";

"Name on card" = "Jméno na kartě";

"New card" = "Nová karta";

"New payment method" = "Nová platební metoda";

"Open your UPI app to approve your payment within %@" = "Otevřete aplikaci UPI, abyste mohli platbu schválit do %@";

"Or" = "Nebo";

"Or pay using" = "Nebo zaplatit pomocí";

"Or pay with a card" = "Nebo zaplatit kartou";

"Or use" = "Nebo použijte";

"Or use a card" = "Nebo použijte kartu";

"Pay %@" = "Zaplatit %@";

"Pay another way" = "Zaplatit jiným způsobem";

"Pay faster at %@ and thousands of businesses." = "Plaťte rychleji u %@ a tisíců firem.";

"Pay over time with %@" = "Platit průběžně pomocí %@";

"Pay over time with Affirm" = "Platit průběžně pomocí Affirm";

"Pay with Link" = "Zaplatit pomocí Link";

"Pay with your bank account in just a few steps." = "Zaplaťte pomocí bankovního účtu v několika málo krocích.";

"Payment failed" = "Platba se nezdařila.";

"Please go back and select another payment method" = "Vraťte se prosím zpět a vyberte jiný způsob platby";

"Point the camera at your card." = "Namiřte fotoaparát na kartu.";

"Processing..." = "Zpracování...";

"Przelewy24 Bank" = "Banka Przelewy24";

"Remove card?" = "Odebrat kartu?";

"Remove payment method" = "Odebrat způsob platby";

"Save" = "Uložit";

"Save a new payment method" = "Uložte novou platební metodu";

"Save address" = "Uložit adresu";

"Save for future payments" = "Uložit pro budoucí platby";

"Save payment details to %@ for future purchases" = "Uložit platební údaje do  %@  pro budoucí nákupy";

"Save this account for future %@ payments" = "Uložit tento účet pro budoucí platby %@";

"Save your bank account in just a few steps." = "Uložte si svůj bankovní účet v několika málo krocích.";

"Save your info for secure 1-click checkout with Link" = "Uložte své údaje pro pro bezpečné odbavení 1 kliknutím u Link";

"Saved" = "Uloženo";

"Select card" = "Vybrat kartu";

"Select payment method" = "Vybrat způsob platby";

"Select your payment method" = "Vyberte svou platební metodu";

"Set up" = "Nastavit";

"Shipping to %@ is not supported." = "Dodání do zemí jako %@ není podporováno.";

"Show menu" = "Zobrazit nabídku";

"Simple, secure one-click payments" = "Jednoduché a bezpečné platby jedním kliknutím";

"Something went wrong when linking your account.\nPlease try again later." = "Při propojování účtu se něco pokazilo.\nZkuste to prosím znovu.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you'll get an email with instructions to finish saving your bank account with %@." = "Stripe vloží 0,01 USD na váš účet během 1 až 2 pracovních dnů. Poté obdržíte e-mail s pokyny k dokončení ukládání na bankovní účet u %@.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "V průběhu 1 až 2 pracovních dnů vloží Stripe na váš účet vklad ve výšce 0,01 USD. Potom dostanete e-mail s instrukcemi k dokončení platby společnosti %@.";

"The IBAN you entered is incomplete." = "Číslo IBAN, které jste zadali, je neúplné.";

"The IBAN you entered is invalid, \"%@\" is not a supported country code." = "Zadané číslo IBAN je neplatné, \"%@\" není podporovaný kód země.";

"Update" = "Aktualizovat";

"Update card brand" = "Aktualizovat značku karty";

"View more" = "Zobrazit více";

"Your IBAN should start with a two-letter country code." = "Číslo IBAN by mělo začínat dvěma písmeny kódu země.";

"iDEAL Bank" = "Banka iDEAL";
